<a href="https://colab.research.google.com/github/dannyoo/Data-Analytics-Playground/blob/master/Titanic_Data_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.read_csv('https://raw.githubusercontent.com/Geoyi/Cleaning-Titanic-Data/master/titanic_clean.csv')

In [0]:
df.head()

,Unnamed: 0,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,has_cabin_number
0,1,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1
1,2,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1
2,3,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1
3,4,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",1
4,5,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1

#### 1 How many missing values are there in each column

In [0]:
df.isnull().sum()

Unnamed: 0             0
pclass                 1
survived               1
name                   1
sex                    1
age                    0
sibsp                  1
parch                  1
ticket                 1
fare                   2
cabin               1015
embarked               0
boat                 824
body                1189
home.dest            565
has_cabin_number       0
dtype: int64

#### 2 Changed Column Number

In [0]:
df.columns = ['Unnamed: 0', 'pclass', 'survived', 'name', 'sex', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body',
       'home.dest', 'cabin_number']

#### 3 Change Name

In [0]:
df['name'].head(10)

0                      Allen, Miss. Elisabeth Walton
1                     Allison, Master. Hudson Trevor
2                       Allison, Miss. Helen Loraine
3               Allison, Mr. Hudson Joshua Creighton
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5                                Anderson, Mr. Harry
6                  Andrews, Miss. Kornelia Theodosia
7                             Andrews, Mr. Thomas Jr
8      Appleton, Mrs. Edward Dale (Charlotte Lamson)
9                            Artagaveytia, Mr. Ramon
Name: name, dtype: object

In [0]:
new = df["name"].str.split(", ", n = 1, expand = True) 

#remove name column
df.drop(['name'], axis=1)

#add first and last name
df['last_name'] = new[0]
df['first_name'] = new[1]
print(df['first_name'].head())
print(df['last_name'].head())

0                    Miss. Elisabeth Walton
1                     Master. Hudson Trevor
2                       Miss. Helen Loraine
3               Mr. Hudson Joshua Creighton
4    Mrs. Hudson J C (Bessie Waldo Daniels)
Name: first_name, dtype: object
0      Allen
1    Allison
2    Allison
3    Allison
4    Allison
Name: last_name, dtype: object

#### 4 How many of each last name have survived?

##### People Aboard

In [0]:
#How many went aboard.
df['last_name'].value_counts()

Sage                      11
Andersson                 11
Goodwin                    8
Asplund                    8
Davies                     7
Carter                     6
Smith                      6
Ford                       6
Skoog                      6
Rice                       6
Fortune                    6
Panula                     6
Johnson                    6
Brown                      6
Ryerson                    5
Kelly                      5
Thomas                     5
Williams                   5
Palsson                    5
Lefebre                    5
Goldsmith                  4
Elias                      4
Baclini                    4
Herman                     4
West                       4
Becker                     4
Ware                       4
Vander Planke              4
Boulos                     4
Dean                       4
                          ..
Peters                     1
Elsbury                    1
Kalvik                     1
Corn                       1
Rheims                     1
Guest                      1
Olsvigen                   1
Milling                    1
Assaf Khalil               1
Silven                     1
Cairns                     1
Aronsson                   1
Johannesen-Bratthammer     1
Ayoub                      1
Pekoniemi                  1
Bidois                     1
Foreman                    1
Colley                     1
Pulbaum                    1
Oxenham                    1
Veal                       1
Daniel                     1
Silverthorne               1
Norman                     1
Harrington                 1
Weir                       1
Tornquist                  1
Denbury                    1
Connors                    1
Kassem                     1
Name: last_name, Length: 875, dtype: int64

In [0]:
# Test To See how many people with the same last name showed were on the titanic.
y=0
for x in df['last_name']:
  if x == "Andersson":
    y=y+1
print(y)

11

#Survived

In [0]:
#survived values are greater than zero
survived = df[df.survived>0]
#count the values of names among those who survived
survived['last_name'].value_counts()

Brown                  5
Fortune                4
Asplund                4
Ryerson                4
Baclini                4
Carter                 4
Becker                 4
Harper                 3
Touma                  3
Frauenthal             3
Richards               3
Sandstrom              3
Nakid                  3
Caldwell               3
Daly                   3
West                   3
Coutts                 3
Kelly                  3
Kink-Heilmann          3
Moubarek               3
Murphy                 3
Wells                  3
McCoy                  3
Dodge                  3
Laroche                3
Peter                  3
Johnson                3
Spedden                3
Quick                  3
Dean                   3
                      ..
Johansson Palmquist    1
Foo                    1
Garside                1
Hold                   1
Lemore                 1
Shine                  1
Slayter                1
McDermott              1
Dowdell                1
Pinsky                 1
Mock                   1
Jussila                1
Mellors                1
Meyer                  1
Mamee                  1
Bazzani                1
Moussa                 1
Rugg                   1
Oliva y Ocana          1
Jermyn                 1
Hellstrom              1
Faunthorpe             1
Bryhl                  1
Endres                 1
Midtsjo                1
White                  1
O'Dwyer                1
Bystrom                1
Bentham                1
Bowen                  1
Name: last_name, Length: 371, dtype: int64